# SystemsAnalysisOutputFolder Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSystemsAnalysisReport..::..SystemsAnalysisOutputFolder Property
ViewSystemsAnalysisReport Class See Also
---
The full path of the output folder for systems analysis
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.1
# Syntax
C#
---
```text
public string SystemsAnalysisOutputFolder { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SystemsAnalysisOutputFolder As String
	Get
```

Visual C++
---
```text
public:
property String^ SystemsAnalysisOutputFolder {
	String^ get ();
}
```

# See Also
ViewSystemsAnalysisReport Class
Autodesk.Revit.DB.Analysis Namespace